chatter/app/controllers/tweets_controller.rb

  def index
    render json: Tweet.all, status: :ok
---
SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" DESC

  def create
    user = User.find(params[:user_id])
    tweet = user.tweets.build(tweet_params) if user
    if tweet.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "abc"], ["user_id", 1], ["created_at", "2020-01-28 11:06:20.275797"], ["updated_at", "2020-01-28 11:06:20.275797"]]