chatter/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    render json: User.all, status: :ok

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def tweets
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def follow_user
    user1 = User.find(params[:user_id1])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def followers
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def followings
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def timeline
    user = User.find(params[:id])

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Kundan"], ["email", "kundan@gmail.com"], ["created_at", "2020-01-28 11:00:22.751086"], ["updated_at", "2020-01-28 11:00:22.751086"]]
---
  def create
    user = User.create(user_params)